[
  {
    "title": "Min portfolio hemsida",
    "img": "portfolio.png",
    "apps": ["PHP", "CSS", "JSON", "JavaScript"],
    "paragraph": "Detta är min portfolio-hemsida där jag visar mina projekt. Jag har gjort sidan responsive så att den fungerar för mindre mobilskärmar också. Prova genom att minska bredden på webbläsaren."
  },
  {
    "title": "Kronk",
    "img": "Kronk01.png",
    "apps": ["Unity3D", "C#", "3dsMax"],
    "paragraph": "Första projekt i Unity3D och första erfarenheten med C# där jag hade hela ansvaret att skriva logiken för spelet, detta innebär bl.a. styra spelaren, få kameran att följa spelaren med mjuka rörelser, hålla reda på spelarens poäng och liv m.m."
  },
  {
    "title": "Wermlandskällar'n - Värmlands Nation",
    "img": "wermlandKitchen.png",
    "apps": ["HTML", "Node.js", "Vue.js", "CSS"],
    "paragraph": "Scrum-projekt på universitetet där vi gjorde början till en meny för personalen att beställa Mat och Dryck."
  },
  {
    "title": "Matrix skärm",
    "img": "matrixScreenShot.png",
    "apps": ["HTML", "HTML5 Canvas", "JavaScript"],
    "paragraph": "Försökte efterlikna Matrix skärmarna med hjälp av HTML5 Canvas."
  },
  {
    "title": "Flygande julgran",
    "img": "tannenbaum.png",
    "apps": ["HTML", "HTML5 Canvas", "JavaScript"],
    "paragraph": "Spel jag gjort med Canvas i HTML5. Spelaren är en flygande julgran som ska överleva så länge som möjligt."
  },
  {
    "title": "Scottify your English",
    "img": "scottish.png",
    "apps": ["HTML", "JavaScript"],
    "paragraph": "Sidan tar en godtyckligt engelsk mening och översätter den skotska."
  },
  {
    "title": "3D Projection",
    "img": "3dPython.png",
    "apps": ["Python", "PyGame"],
    "paragraph": "Under kursen \"Linjär Algebra\", tyckte jag uppgifterna var för icke-praktiska. Jag skrev då ett 3D-renderingsprogram för att lära mig matematiken i kursen på ett roligt och mer praktiskt sätt. Detta fungerade bra och jag klarade kursen med högsta betyg."
  },
  {
    "title": "Bumpmap to Normalmap",
    "img": "BumpNormalMap.png",
    "apps": ["Python", "PyGame", "wxPython"],
    "paragraph": "Detta är ett simpelt program som gör om en valfri bumpmap till en normalmap."
  },
  {
    "title": "Graph Calculator Python",
    "img": "GraphCalc.png",
    "apps": ["Python", "wxPython", "SymPy"],
    "paragraph": "Detta var ett kort universitets-projekt med mig och en vän där vi gjorde en simpel grafräknare."
  },
  {
    "title": "Sudoku-solver Haskell",
    "img": "sudoku.png",
    "apps": ["Haskell"],
    "paragraph": "Grupp-projekt i det funktionella programmeringsspråket Haskell. Vi gjorde ett spelbart sudokuspel och inkludera en logisk solver."
  }
]
